# Perimeter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElement..::..Perimeter Property
SpatialElement Class See Also
---
The perimeter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Perimeter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Perimeter As Double
	Get
```

Visual C++
---
```text
public:
property double Perimeter {
	double get ();
}
```

# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace